[
  {
    "id": "1",
    "title": "Welcome to The Quiet Space",
    "slug": "welcome-to-the-quiet-space",
    "excerpt": "An introduction to the quiet space blog.",
    "content": "This is the first blog post.",
    "author": "Admin",
    "publishedAt": "2025-10-19T00:00:00.000Z"
  },
  {
    "id": "2",
    "title": "Test",
    "slug": "test",
    "format": "markdown",
    "excerpt": "A short, grounded practice to help you anchor into your day and cultivate calm through presence.",
    "content": "This is a [Next.js](https://nextjs.org) project bootstrapped with [`create-next-app`](https://nextjs.org/docs/app/api-reference/cli/create-next-app).\n\n## Getting Started\n\nFirst, run the development server:\n\n```bash\nnpm run dev\n# or\nyarn dev\n# or\npnpm dev\n# or\nbun dev\n```\n\nOpen [http://localhost:3000](http://localhost:3000) with your browser to see the result.\n\nYou can start editing the page by modifying `app/page.tsx`. The page auto-updates as you edit the file.\n\nThis project uses [`next/font`](https://nextjs.org/docs/app/building-your-application/optimizing/fonts) to automatically optimize and load [Geist](https://vercel.com/font), a new font family for Vercel.\n\n## Learn More\n\nTo learn more about Next.js, take a look at the following resources:\n\n- [Next.js Documentation](https://nextjs.org/docs) - learn about Next.js features and API.\n- [Learn Next.js](https://nextjs.org/learn) - an interactive Next.js tutorial.\n\nYou can check out [the Next.js GitHub repository](https://github.com/vercel/next.js) - your feedback and contributions are welcome!\n\n## Deploy on Vercel\n\nThe easiest way to deploy your Next.js app is to use the [Vercel Platform](https://vercel.com/new?utm_medium=default-template&filter=next.js&utm_source=create-next-app&utm_campaign=create-next-app-readme) from the creators of Next.js.\n\nCheck out our [Next.js deployment documentation](https://nextjs.org/docs/app/building-your-application/deploying) for more details.",
    "author": "Anonymous",
    "publishedAt": "2025-10-19T05:17:21.964Z"
  },
  {
    "id": "3",
    "title": "Practicing Gentle Presence: A 10-Minute Daily Ritual",
    "slug": "practicing-gentle-presence-10-minute-ritual",
    "excerpt": "A short, grounded practice to help you anchor into your day and cultivate calm through presence.",
    "format": "markdown",
    "content": "# Practicing Gentle Presence: A 10-Minute Daily Ritual\n\nCultivating presence doesn't require sweeping life changes. It begins with small, intentional acts offered to yourself each day. This 10-minute ritual—designed for busy people, caregivers, and anyone who wants a steadier nervous system—uses breath, gentle movement, and brief reflection to reorient attention away from habitual stress cycles and back into the body.\n\n## The Practice\n\n**Start** by finding a comfortable seat or standing with feet hip-width apart. Allow your shoulders to soften and your jaw to release. For the first two minutes, place one hand over your heart and one over your belly. Breathe slowly into the place beneath your ribs and let your exhale be complete. This practice of heart-centered breathing signals safety to the nervous system and invites your attention away from the mind's constant doing.\n\n**Minute Three**: bring gentle movement—roll your shoulders slowly back three times, then ease a soft neck stretch to each side—moving slowly enough to feel what is happening in your muscles and joints. Movement with attention reminds the body that sensation can be observed without immediate reaction.\n\n**Minute Five**: perform a 3-part body scan. Starting at the crown of the head, notice each area—forehead, eyes, jaw, neck, shoulders, chest, belly, hips, knees, and feet—pausing briefly to soften any tightness you find.\n\n**Minute Seven**: insert a gratitude seed: recall one small thing you are grateful for in this moment—a tea mug, a message, the way sunlight fell on your floor—and let that feeling fill a few gentle breaths.\n\n**Minute Eight**: set an intention: a single, positive phrase you can carry through the day (for example: 'I will practice kindness' or 'I will return to breath'). Say it quietly to yourself three times.\n\n**Minute Nine**: create a tiny micro-commitment to care: one thing you will do today that honors your limits (take a five-minute break, say no to something, eat without multitasking).\n\n---\n\n## Closing\n\nThe final minute, return to the breath. Notice the quality of your attention now compared to when you started. Presence is less about perfection and more about the gentle redirection of attention away from distraction. Practice this ritual daily for two weeks and notice small changes: moments of reactivity slipping into steadier patience, clearer choices, and a gentle increase in ease. Over time, these tiny pauses weave into larger patterns of resilience.",
    "author": "Somatic Coach",
    "publishedAt": "2025-10-19T06:00:00.000Z"
  },
  {
    "id": "4",
    "title": "My Raw Markdown Title",
    "slug": "test-raw-md",
    "excerpt": "This is a test post created from raw markdown.",
    "content": "# My Raw Markdown Title\n\nThis is a test post created from raw markdown.\n\n---\n\nMore content after a horizontal rule.",
    "format": "markdown",
    "author": "Anonymous",
    "publishedAt": "2025-10-19T05:58:16.502Z"
  }
]